app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (rating IN ('G','PG','PG-13','R')) ORDER BY release_date
---
  def index
    if params[:cssclass]
      if params[:order] == "title"
        @title_class = params[:cssclass]
      elsif params[:order] == "release_date"
        @date_class = params[:cssclass]
      end
    end

    if params[:cssid]
      if params[:order] == "title"
        @title_id = params[:cssid]
      elsif params[:order] == "release_date"
        @date_id = params[:cssid]
      end
    end

    order = params[:order]
    @movies = Movie.find(:all, :order => order)

INSERT INTO "movies" ("created_at", "description", "rating", "release_date", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @movie = Movie.create!(params[:movie])